{
    "Timestamp": "Time",
    "FillPrice": "Price",
    "FillTime": "Time",
    "Filled At": "Time",
    "Fill Amount": "Filled",
    "Order Price": "Price",
    "CreatedAt": "Time",
    "Available Balance": "Available",
    "NoMarketSelects": "No markets.",
    "NoOpenOrders": "No orders.",
    "NoHistoryOrders": "No orders",
    "All Tokens": "All Assets",
    "Order Total": "Total",
    "NoBalance": "No balance in your account.",
    "NoDeposits": "No deposits in your account.",
    "NoWithdrawals": "No withdrawals in your account.",
    "TimingWhy": "We need 30 confirmations for your Ethereum transactions before we start generating the Zero-Knowledge proof to process your requests.",
    "FeeWhy": "The Loopring protocol requires us to process every user request, including account registration, account-key-reset, deposits, and withdrawals. We charge fees to cover Zero-Knowledge proof cost and Ethereum transaction gas fee, and also to avoid Sybil attack.",
    "DepositInstruction_1": "Deposit assets to your exchange account to start trading. Please note that Loopring is a non-custodial exchange protocol, which means only you have access to your exchange account and assets. You can request withdrawals anytime.",
    "DepositInstruction_Timing": "Deposits usually take 5 to 30 minutes. In some situations, they may take longer. Note: after you see your Ethereum transaction confirmed on-chain, it will be perfectly normal that it says 'processing' on the exchange, and that your deposit will not immediately be in your account: the relayer must prove the batch. Please be patient. Once your assets are on the exchange, that's when you can go at light-speed!",
    "DepositInstruction_Fee_1": "We charge ",
    "DepositInstruction_Fee_2": " for each deposit.",
    "DepositInstruction_KeepEther": "Please keep some Ether in your wallet for withdrawals.",
    "DepositInstruction_KeepEtherWhy": "We suggest you keep some small amount of Ether in your wallet to pay future withdrawal fees (0.002 ETH per withdrawal) and transaction gas. This suggestion will become invalid once we support off-chain withdrawals.",
    "DepositInstructionNotification": "Your deposit request has been submitted to Ethereum. Please monitor your transaction, as you will not see the corresponding deposit record on Loopring Exchange before it is confirmed on-chain.",
    "DepositInstructionNotificationFailed": "Your deposit request failed. Please try again!",
    "WithdrawInstruction_1": "The Loopring protocol assures all withdrawal requests must be processed unconditionally in the order they are received. Withdrawals are always guaranteed to end up back in the rightful user's wallet, no matter what.",
    "WithdrawInstruction_Timing": "Withdrawals usually take 5 to 30 minutes. In some situations, they may take longer. Note: after you see your Ethereum transaction confirmed on-chain, it will be perfectly normal that it says 'processing' on the exchange, and that your withdrawal will not immediately be in your wallet: the relayer must prove the batch. Please be patient. Your assets are always 100% in your control.",
    "WithdrawInstruction_Fee_1": "We charge ",
    "WithdrawInstruction_Fee_2": " for each withdrawal.",
    "WithdrawInstructionNotification": "Your withdrawal request has been submitted to Ethereum. Please monitor your transaction, as you will not see the corresponding withdrawal record on Loopring Exchange before it is confirmed on-chain. Note: after you see your Ethereum transaction confirmed on-chain, it will be perfectly normal that it says 'processing' on the exchange, and that your withdrawal will not immediately be in your wallet: the relayer must prove the batch. Please be patient.",
    "WithdrawInstructionNotificationFailed": "Your withdrawal request failed. Please try again!",
    "LogoutInstruct_1": "Logging out of the Loopring Exchange will clear your account key from this browser. You can log in again. You can always reset your account key with an Ethereum transaction, which means forgetting your account key will not make you lose any funds on Loopring.",
    "LogoutInstruct_2": "Are you sure you want to log out?",
    "AccountBeingRegisteredInstruct_1": "Your account is being created. We will wait for at least one confirmation for your Ethereum transaction. Please be patient.",
    "RegisterAccountInstruction_1": "You need an exchange account before trading. This simply ties your Ethereum address to the exchange Merkle tree. You can make deposits while your account registration request is still being processed. Trading and withdrawls will only be available after your account has been registered.",
    "RegisterAccountInstruction_Timing": "Account registration usually takes 5 to 30 minutes. In some situations, it may take longer. Note: after your Ethereum transaction is confirmed on-chain, it will be perfectly normal that it says 'processing' on the exchange: the relayer needs to prove the batch. Please be patient.",
    "RegisterAccountInstruction_Fee_1": "We charge ",
    "RegisterAccountInstruction_Fee_2": " for account registration.",
    "RegisterAccountInstruction_FeeWhy": "The current version of the Loopring protocol can only support up to 1 million users for each exchange (to reduce Zero-Knowledge proof cost). We charge account registration fees to cover relayer cost and Ethereum transaction gas, and also to avoid Sybil attack.",
    "ResetAccountKeyInstruction_1": "Using a different account key will automatically cancel all your existing orders. Before your account key is reset, you will not be able to trade, or submit any withdrawal requests.",
    "ResetAccountKeyInstruction_Timing": "Resetting account key usually takes 5 to 30 minutes. In some situations, it may take longer. Please be patient.",
    "ResetAccountKeyInstruction_Fee_1": "We charge ",
    "ResetAccountKeyInstruction_Fee_2": " for resetting account key.",
    "WelcomeBack": "Welcome back to Loopring Exchange!",
    "UnsupportedNetworkWarning": "You are on a wrong network! Please switch to ",
    "EthereumMainNet": "Ethereum mainnet.",
    "EthereumRinkebyTestnet": "Ethereum's Rinkeby mainnet.",
    "EthereumGörliTestNet": "Ethereum's Görli mainnet.",
    "IsNotAValidMarket": " is not a valid market or is not supported yet!",
    "IsNotInviteLink": "Not a valid referral link!",
    "AccountHasRegisteredInInviteLink": "Your account has been registered. Failed to use the referral link.",
    "AccountBeingRegisteredNotification": "Your account is being registered. Usually it takes 5 to 30 minutes; but in some situations, it may take longer. You can make deposits while waiting.",
    "AccountRegistrationFailedNotification": "Something went wrong. Please try to register again!",
    "AccountKeyResetNotification": "Your account key is resetting. Usually it takes 5 to 30 minutes; but in some situations, it may take longer. You can make deposits while waiting.",
    "AccountKeyResetFailedNotification": "Something went wrong. Please try to reset again!",
    "Web3 Unavailable": "MetaMask Unavailable",
    "Web3UnavailableTip": "You need MetaMask installed before using Loopring Exchange!",
    "ConnectToWeb3Tip": "Connect to your Ethereum account to start using Loopring Exchange.",
    "MetaMaskNotDetected": "MetaMask is not detected. You must have MetaMask to use Loopring Exchange!",
    "NoAccountTooltip": "You don't have a Loopring Exchange account yet, please click the button below to register.",
    "NeedLoginTooltip": "You need to log in to start trading.",
    "YouHaveLoggedInTooltip": "You have logged in. Enjoy our non-custodial & high-performance trading experience!",
    "exportAccountWarning": "Please keep the following information private; otherwise, you may lose your assets on the exchange.",
    "Maximum_price_input_decimal_part_1": "The number of price decimal points can't be larger than ",
    "Maximum_amount_input_decimal_part_1": "The number of amount decimal points can't be larger than ",
    "Maximum_order_total_input_decimal_part_1": "The number of total decimal points can't be larger than ",
    "Maximum_input_decimal_part_2": "",
    "Minimum_order_size": "Minimum order size:",
    "Maximum_order_size": "Maximum order size:",
    "MobileNotSupportedNotice": "Loopring Exchange doesn't support mobile devices yet. We apologize for any inconvenience.",
    "MobileAppNotice": "We will launch a smart-wallet mobile app with a built-in Loopring Exchange soon.",
    "CookieConsentMessage": "By using our site you agree to accept our ",
    "404title": "Hmmm, the page is lost in the loop...",
    "generateKeyPairTip": "Sign a message to generate a new account key (this is not a transaction).",
    "registerTxTip": "Approve transaction to create your exchange account.",
    "resetAccountKeyTip": "Please approve a 2nd transaction to reset your account key.",
    "metaMaskPendingTxTip": "Pay attention to the pending requests in MetaMask. Sometimes MetaMask doesn't pop up dialogs for you, so you have to click on your browser's MetaMask button to check these transactions.",
    "metamaskConfirm": "Please approve MetaMask requests",
    "walletConnectConfirm": "Please approve requests through your WalletConnect-compatible wallet",
    "walletConnectPendingTxTip": "We have initiated a signature request to your wallet, please approve the transaction",
    "depositTipApproveZero": "Please approve the 1st transaction to cancel Loopring's current allowance (too small).",
    "depositTipApprove1": "Please approve the 1st transaction to approve Loopring's allowance.",
    "depositTipApprove3_2": "Please approve a 2nd transaction to approve Loopring's new allowance.",
    "depositTipDeposit2": "Please approve a 2nd transaction to deposit tokens. (You can ignore warning, your transaction will succeed.)",
    "depositTipDeposit3": "Please approve a 3rd transaction to deposit tokens. (You can ignore warning, your transaction will succeed.)",
    "YourEthereumAddressIs": "You are using this address: ",
    "MenuSupportGroup": "Support",
    "MenuTechnicalResourcesGroup": "Technical Resources",
    "MenuExchangeInfoGroup": "Exchange Info",
    "MenuMyEthAccount": "My Address",
    "MenuMyDexAccount": "My Account",
    "MaintenanceModalTitle": "Our system is under maintenance.",
    "MaintenanceModalInstruction": "We are sorry for any inconvenience.",
    "StatusConfirming": "We need at least 30 confirmations for your request on Ethereum. Then we can start generating the Zero-Knowledge proof.",
    "NoChineseDocument": "",
    "HonorVip": "Loopring Lifetime Honor VIP",
    "Status / Operations": "Status",
    "BuyPriceHigher": "Your buy price is 20% higher than the last price.",
    "SellPriceLower": "Your sell price is 20% lower than the last price.",
    "AutomaticTheme": "Switch automatically based on my time",
    "CancelAllConfirm": "Are you sure you want to cancel all open orders?",
    "CopyReferralLink": "Copied referral link successfully",
    "Referral_Instruct_1": "If your average daily LRC balance on the exchange is 5,000 LRC or more, you receive 60% of your friend's trading fees, and your friend receives 20% of his own trading fees back. If your balance is less than 5,000 LRC, you receive 30% of your friend's trading fees, and your friend receives 10%.",
    "Referral Link": "Referral Link: ",
    "LoginFailedNotification": "Login failed! Please try again.",
    "LoginFailedIncorrectAccountKey": "Failed to log in. If you used to use password to log in, now you need to reset your account key!",
    "LearnAccountKeys": "Learn how Loopring manages account keys.",
    "Liquidity Mining": "Liquidity Mining",
    "Referral Rewards": "Referral Rewards",
    "No rewards yet": "No rewards yet",
    "Rewards": "Rewards",
    "Ranking": "Ranking",
    "Total Ranking": "Ranking",
    "NoRankingData": "No ranking data",
    "StatusProcessing": "After your request transaction (including registration, resetting password, deposits, and withdrawals) has 30 confirmations on Ethereum, our relayer needs to aggregate other requests to fill up a batch, and then start 'proving' it. This zero-knowledge proof is what ensures the Loopring Exchange can never cheat. If there are not many requests at this moment, the relayer waits a bit longer because it prefers proving bigger batches for efficiency. Usually, this takes 5 to 30 minutes. Please be patient - the Loopring protocol guarantees all your requests will be processed. With more users and activities, request processing will become much quicker!",
    "TransferInstruction_Fee_1":"We charge ",
    "TransferInstruction_Fee_2":" for an account transfer",
    "TransferInstruction_Fee_3":"Transfers are currently completely free, so go wild!",
    "TransferInstructionNotification":"Your transfer request has been submitted.",
    "TransferInstructionNotificationFailed":"Your transfer request is failed, please try again",
    "TransferInstruction_1":"Loopring Pay is a layer-2 fast payment service. It allows for secure, scalable payments on Ethereum using our zkRollup. No waiting, no gas fees. You can transfer Ether and supported ERC20 tokens to any Ethereum address(or ENS name) that has registered on Loopring.io.",
    "TransferInstruction_2":"Because these transfers happen on our zkRollup, that means the recipient must also be on it. If they are not, then you should invite them so they too can benefit from fast, free, and completely non-custodial transfers! Invite them with your referral link",
    "TransferInstruction_2_end":"",
    "ReferralLinkInstruction":"For every new account that registers with your referral code until end of June 15th (EST), you will receive 40 LRC.",
    "ReferralLinkInstructionDescription":"Note: Your referral code is simply your Exchange Account ID. Your Account ID is mapped to your Ethereum public address in the zkRollup. Whomever you share your referral code with is able to know the associated Ethereum address. If you don’t want someone to know an address belongs to you, do not share your referral code with them."
}
