{
    "Timestamp": "Time",
    "FillPrice": "Price",
    "FillTime": "Time",
    "Filled At": "Time",
    "Fill Amount": "Filled",
    "Order Price": "Price",
    "CreatedAt": "Time",
    "Available Balance": "Available",
    "NoMarketSelects": "No markets.",
    "NoOpenOrders": "No orders.",
    "NoHistoryOrders": "No orders",
    "All Tokens": "All Assets",
    "Order Total": "Total",
    "Activity Time": "Time",
    "NoBalance": "No balance in your account.",
    "NoDeposits": "No deposits in your account.",
    "NoWithdrawals": "No withdrawals in your account.",
    "TimingWhy": "We need 30 confirmations for your Ethereum transactions before we start batching and generating the Zero-Knowledge proof to process your requests.",
    "FeeWhy": "The Loopring protocol requires us to process every user request, including account activation, layer-2 keypair reset, deposits, and withdrawals. We charge fees to cover Zero-Knowledge proof cost and Ethereum transaction gas fee, and also to avoid Sybil attack.",
    "DepositInstruction_1": "Deposit assets to your exchange account to start trading. Please note that Loopring is a non-custodial exchange protocol, which means only you have access to your exchange account and assets. You can request withdrawals anytime.",
    "DepositInstruction_Timing": "Deposits take 30 Ethereum confirmations. Note: after you see your Ethereum transaction confirmed on-chain, it will say 'processing' on the exchange, and your deposit will not immediately be in your account while we wait for 30 confirmations. Once your assets are on the exchange, that's when you can go at light-speed!",
    "DepositInstruction_Fee_1": "We charge ",
    "DepositInstruction_Fee_2": " for each deposit.",
    "DepositInstruction_KeepEther": "Please keep some Ether in your wallet for withdrawals.",
    "DepositInstruction_KeepEtherWhy": "We suggest you keep some small amount of Ether in your wallet to pay future withdrawal fees (0.02 ETH per withdrawal) and transaction gas. This suggestion will become invalid once we support off-chain withdrawals.",
    "DepositInstructionNotification": "Your deposit request has been submitted to Ethereum. Please monitor your transaction, as you will not see the corresponding deposit record on Loopring Exchange before it is confirmed on-chain.",
    "DepositInstructionNotificationFailed": "Your deposit request failed. Please try again!",
    "ClaimInstructionNotification":"Your claim request has been submitted to Ethereum. Please monitor your transaction and your token balance.",
    "ClaimInstructionNotificationFailed":"Your claim request failed. Please try again!",
    "WithdrawInstruction_1": "The Loopring protocol assures all withdrawal requests must be processed unconditionally in the order they are received. Withdrawals are always guaranteed to end up back in the rightful user's wallet, no matter what.",
    "WithdrawInstruction_Timing": "Withdrawals usually take 5 to 30 minutes. In instances of extremely high gas prices, delays of several hours can arise as we wait for batches to be more full. Note: after you see your Ethereum transaction confirmed on-chain, it will say 'processing' on the exchange, and your withdrawal will not immediately be in your wallet: the relayer must aggregate and prove the batch. Please be patient. Your assets are always 100% in your control.",
    "WithdrawInstruction_Fee_1": "We charge ",
    "WithdrawInstruction_Fee_2": " for each withdrawal.",
    "WithdrawInstructionNotification": "Your withdrawal request has been submitted to Ethereum. Please monitor your transaction, as you will not see the corresponding withdrawal record on Loopring Exchange before it is confirmed on-chain. Note: after you see your Ethereum transaction confirmed on-chain, it will say 'processing' on the exchange, and your withdrawal will not immediately be in your wallet: the relayer must aggregate and prove the batch. Please be patient.",
    "WithdrawInstructionNotificationFailed": "Your withdrawal request failed. Please try again!",
    "LogoutInstruct_1": "Locking your acccount on layer-2 will terminate your browser session.",
    "LogoutInstruct_2": "Do you want to continue?",
    "AccountBeingRegisteredInstruct_1": "Your account is being created. We will wait for at least one confirmation for your Ethereum transaction. Please be patient.",
    "RegisterAccountInstruction_1": "You need an exchange account before trading. This simply ties your Ethereum address to the exchange Merkle tree. You can make deposits while your account activation request is still being processed. Trading and withdrawals will only be available after your account has been activated for layer-2.",
    "RegisterAccountInstruction_Timing": "Account activation takes 30 Ethereum confirmations. Note: after your Ethereum transaction is confirmed on-chain, it will say 'processing' on the exchange as we wait for 30 confirmations. During this wait time, you can deposit assets, but not trade or withdraw.",
    "RegisterAccountInstruction_Fee_1": "We charge ",
    "RegisterAccountInstruction_Fee_2": " for account activation.",
    "RegisterAccountInstruction_FeeWhy": "The current version of the Loopring protocol can only support up to 1 million users for each exchange (to reduce Zero-Knowledge proof cost). We charge account activation fees to cover relayer cost and Ethereum transaction gas, and also to avoid Sybil attack.",
    "ResetAccountKeyInstruction_1": "Using a different layer-2 keypair will automatically cancel all your existing orders. Before your layer-2 keypair is reset, you will not be able to trade, nor submit any withdrawal requests.",
    "ResetAccountKeyInstruction_Timing": "Resetting layer-2 keypair takes 30 Ethereum confirmations. Please be patient.",
    "ResetAccountKeyInstruction_Fee_1": "We charge ",
    "ResetAccountKeyInstruction_Fee_2": " for layer-2 keypair reset.",
    "ResetApiKeyInstruction_1": "API key reset is free and instant.",
    "ResetApiKeyInstruction_2": "Once you reset your API key, you will get a new one and the previous one will be invalid.",
    "WelcomeBack": "Welcome back to Loopring Exchange!",
    "UnsupportedNetworkWarning": "You are on a wrong network! Please switch to ",
    "EthereumMainNet": "Ethereum mainnet.",
    "EthereumRinkebyTestnet": "Ethereum's Rinkeby mainnet.",
    "EthereumGörliTestNet": "Ethereum's Görli mainnet.",
    "IsNotAValidMarket": " is not a valid market or is not supported yet!",
    "IsNotInviteLink": "Not a valid referral link!",
    "AccountHasRegisteredInInviteLink": "Your account has been activated for layer-2. Failed to use the referral link.",
    "AccountBeingRegisteredNotification": "Your account is being activated. It takes 30 Ethereum confirmations. You can make deposits while waiting.",
    "AccountRegistrationFailedNotification": "Something went wrong. Please try to activate your account again!",
    "AccountKeyResetNotification": "Your layer-2 keypair is being reset. It takes 30 Ethereum confirmations. You can make deposits while waiting.",
    "AccountKeyResetFailedNotification": "Something went wrong. Please try again!",
    "ApiKeyResetNotification": "Your API key has been reset successfully.",
    "ApiKeyResetFailedNotification": "Failed to reset API key, please try again.",
    "Web3 Unavailable": "MetaMask Unavailable",
    "Web3UnavailableTip": "You need MetaMask installed before using Loopring Exchange!",
    "ConnectToWeb3Tip": "Connect to your Ethereum account to start using Loopring Exchange.",
    "MetaMaskNotDetected": "MetaMask is not detected. You must have MetaMask to use Loopring Exchange!",
    "NoAccountTooltip": "Your account has not been activated for layer-2 yet, please click the button below to continue.",
    "NeedLoginTooltip": "You need to unlock your account on layer-2 to start trading.",
    "YouHaveLoggedInTooltip": "You have logged in. Enjoy our non-custodial, gas-free & high-performance trading experience!",
    "exportAccountWarning": "Please keep the following information private; otherwise, you may lose your assets on the exchange.",
    "Maximum_price_input_decimal_part_1": "The number of price decimal points can't be larger than ",
    "Maximum_amount_input_decimal_part_1": "The number of amount decimal points can't be larger than ",
    "Maximum_order_total_input_decimal_part_1": "The number of total decimal points can't be larger than ",
    "Maximum_input_decimal_part_2": "",
    "Minimum_order_size": "Minimum order size:",
    "Maximum_order_size": "Maximum order size:",
    "MobileNotSupportedNotice": "Loopring Exchange doesn't support mobile devices yet. We apologize for any inconvenience.",
    "MobileAppNotice": "We will launch a smart-wallet mobile app with a built-in Loopring Exchange soon.",
    "CookieConsentMessage": "By using our site you agree to accept our ",
    "404title": "Hmmm, the page is lost in the loop...",
    "generateKeyPairTip": "Sign a message to generate a new layer-2 keypair (this is not a transaction).",
    "registerTxTip": "Approve transaction to activate your account for layer-2.",
    "resetAccountKeyTip": "Please approve a 2nd transaction to reset your layer-2 keypair.",
    "metaMaskPendingTxTip": "Pay attention to the pending requests in MetaMask. Sometimes MetaMask doesn't pop up dialogs for you, so you have to click on your browser's MetaMask button to check these transactions.",
    "metamaskConfirm": "Please approve MetaMask requests",
    "walletConnectConfirm": "Please approve requests through your wallet",
    "walletConnectPendingTxTip": "We have initiated a signature request to your wallet, please approve the transaction",
    "depositTipApproveZero": "Please approve the 1st transaction to cancel Loopring's current allowance (too small).",
    "depositTipApprove1": "Please approve the 1st transaction to approve Loopring's allowance.",
    "depositTipApprove3_2": "Please approve a 2nd transaction to approve Loopring's new allowance.",
    "depositTipDeposit2": "Please approve a 2nd transaction to deposit tokens. (You can ignore warning, your transaction will succeed.)",
    "depositTipDeposit3": "Please approve a 3rd transaction to deposit tokens. (You can ignore warning, your transaction will succeed.)",
    "YourEthereumAddressIs": "You are using this address: ",
    "MenuSupportGroup": "Support",
    "MenuTechnicalResourcesGroup": "Technical Resources",
    "MenuExchangeInfoGroup": "Exchange Info",
    "MenuMyEthAccount": "My Address (Layer-1)",
    "MenuMyDexAccount": "My Layer-2 Account",
    "MaintenanceModalTitle": "Our system is under maintenance.",
    "MaintenanceModalInstruction": "We are sorry for any inconvenience.",
    "StatusConfirming": "We need at least 30 confirmations for your request on Ethereum. Then we can start generating the Zero-Knowledge proof.",
    "NoChineseDocument": "",
    "HonorVip": "Loopring Lifetime Honor VIP",
    "Status / Operations": "Status",
    "BuyPriceHigher": "Your buy price is 20% higher than the last price.",
    "SellPriceLower": "Your sell price is 20% lower than the last price.",
    "AutomaticTheme": "Switch automatically based on my time",
    "CancelAllConfirm": "Are you sure you want to cancel all open orders?",
    "CopyReferralLink": "Copied referral link successfully",
    "Referral_Instruct_1": "If your average daily LRC balance on the exchange is 5,000 LRC or more, you receive 24% of your friend's trading fees, and your friend receives 8% of his own trading fees back. If your balance is less than 5,000 LRC, you receive 12% of your friend's trading fees, and your friend receives 4%.",
    "Referral Link": "Referral Link: ",
    "LoginFailedNotification": "Failed to unlock your account on layer-2. Please try again.",
    "LoginFailedIncorrectAccountKey": "Failed to unlock your account on layer-2.",
    "LearnAccountKeys": "Learn how Loopring manages layer-2 keypair.",
    "Liquidity Mining": "Liquidity Mining",
    "Referral Rewards": "Referral Rewards",
    "No rewards yet": "No rewards yet",
    "Rewards": "Rewards",
    "Ranking": "Ranking",
    "Total Ranking": "Ranking",
    "NoRankingData": "No ranking data",
    "StatusProcessing": "After your transaction request (activation, layer-2 keypair reset, deposits, and withdrawals), we wait for 30 confirmations on Ethereum. For withdrawals it then takes longer, as our relayer aggregates other withdrawals to fill up a batch, and then starts 'proving' it. This zero-knowledge proof is what ensures the Loopring Exchange can never cheat. Usually this takes 5 to 30 minutes, but in periods of extremely high gas prices, this can take several hours since the relayer seeks to aggregate bigger batches for efficiency (like an airplane wanting to fill its seats). Please be patient. Your assets are always 100% in your control.",
    "TransferInstruction_Fee_1":"We charge ",
    "TransferInstruction_Fee_2":" for an account transfer",
    "TransferInstruction_Fee_3":"Transfers are currently completely free, so go wild!",
    "TransferInstructionNotification":"Your transfer request has been submitted.",
    "TransferInstructionNotificationFailed":"Your transfer request is failed, please try again",
    "TransferInstruction_1":"Loopring Pay is a layer-2 fast payment service. It allows for secure, scalable payments on Ethereum using our zkRollup. No waiting, no gas fees. You can transfer Ether and supported ERC20 tokens to any Ethereum address (or ENS name) that has registered on Loopring.",
    "TransferInstruction_2":"Because these transfers happen on our zkRollup, that means the recipient must also be on it. If they are not, then you should invite them so they too can benefit from fast, free, and completely non-custodial transfers! Invite them with your referral link",
    "TransferInstruction_2_end":"",
    "ReferralLinkInstruction":"You will receive 40 LRC for each activated account using your referral code.",
    "ReferralLinkInstructionDescription":"Note: Your referral code is simply your Exchange Account ID. Your Account ID is mapped to your Ethereum public address in the zkRollup. Whomever you share your referral code with is able to know the associated Ethereum address. If you don’t want someone to know an address belongs to you, do not share your referral code with them.",
    "liquidity_mining_instruction":"Place maker orders (resting limit orders) on the GRG-ETH, USDC-USDT and USDT-DAI orderbooks, and earn your share of 8000 USDT. Measured by spread and depth, read more",
    "liquidity_mining_instruction_link":" here",
    "liquidity_mining_instruction_end":".",
    "liquidity_mining_tools_instruction":"There are three market making tools that may help automate your liquidity mining",
    "liquidity_mining_info_instruction":"For more information on liquidity mining and related calculations, please see",
    "maintenanceTitle": "Sorry, we're down for scheduled maintenance right now."
}
